export const vacation = {
	 	"202151": {
	 		title: "劳动节",
	 		type: "休",
	 	},
	 	"202152": {
	 		title: "劳动节",
	 		type: "休",
	 	},
	 	"202153": {
	 		title: "劳动节",
	 		type: "休",
	 	},
	 	"202154": {
	 		title: "劳动节",
	 		type: "休",
	 	},
	 	"202155": {
	 		title: "劳动节",
	 		type: "休",
	 	},
	 	"202158": {
	 		title: "劳动节",
	 		type: "班",
	 	},
	 	"2021612": {
	 		title: "端午",
	 		type: "休",
	 	},
	 	"2021613": {
	 		title: "端午",
	 		type: "休",
	 	},
	 	"2021614": {
	 		title: "端午",
	 		type: "休",
	 	},
	 	"2021918": {
	 		title: "中秋",
	 		type: "班",
	 	},
	 	"2021919": {
	 		title: "中秋",
	 		type: "休",
	 	},
	 	"2021920": {
	 		title: "中秋",
	 		type: "休",
	 	},
	 	"2021921": {
	 		title: "中秋",
	 		type: "休",
	 	},
	 	"2021926": {
	 		title: "国庆",
	 		type: "班",
	 	},
	 	"2021101": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021102": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021103": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021104": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021105": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021106": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021107": {
	 		title: "国庆",
	 		type: "休",
	 	},
	 	"2021109": {
	 		title: "国庆",
	 		type: "班",
	 	},
	 	"202211": {
	 		title: "元旦",
	 		type: "休",
	 	},
	 	"202212": {
	 		title: "元旦",
	 		type: "休",
	 	},
	 	"202213": {
	 		title: "元旦",
	 		type: "休",
	 	},
		"2022129":{
			 title:"春节",
			 type:"班",
		},
		"2022130":{
			 title:"春节",
			 type:"班",
		},
		"2022131":{
			 title:"除夕",
			 type:"休",
		},
		"202221":{
			 title:"春节",
			 type:"休",
		},
		"202222":{
			 title:"初二",
			 type:"休",
		},
		"202223":{
			 title:"初三",
			 type:"休",
		},
		"202224":{
			 title:"初四",
			 type:"休",
		},
		"202225":{
			 title:"初五",
			 type:"休",
		},
		"202226":{
			 title:"初六",
			 type:"休",
		},
		"202242":{
			 title:"清明",
			 type:"班",
		},
		"202243":{
			 title:"清明",
			 type:"休",
		},
		"202244":{
			 title:"清明",
			 type:"休",
		},
		"202245":{
			 title:"清明",
			 type:"休",
		},
		"2022424":{
			 title:"劳动节",
			 type:"班",
		},
		"2022430":{
			 title:"劳动节",
			 type:"休",
		},
		"202251":{
			 title:"劳动节",
			 type:"休",
		},
		"202252":{
			 title:"劳动节",
			 type:"休",
		},
		"202253":{
			 title:"劳动节",
			 type:"休",
		},
		"202254":{
			 title:"劳动节",
			 type:"休",
		},
		"202257":{
			 title:"劳动节",
			 type:"班",
		},
		"202263":{
			 title:"端午节",
			 type:"休",
		},
		"202264":{
			 title:"端午节",
			 type:"休",
		},
		"202265":{
			 title:"端午",
			 type:"休",
		},
		"2022910":{
			 title:"中秋",
			 type:"休",
		},
		"2022911":{
			 title:"中秋",
			 type:"休",
		},
		"2022912":{
			 title:"中秋",
			 type:"休",
		},
		"2022101":{
			 title:"国庆",
			 type:"休",
		},
		"2022102":{
			 title:"国庆",
			 type:"休",
		},
		"2022103":{
			 title:"国庆",
			 type:"休",
		},
		"2022104":{
			 title:"国庆",
			 type:"休",
		},
		"2022105":{
			 title:"国庆",
			 type:"休",
		},
		"2022106":{
			 title:"国庆",
			 type:"休",
		},
		"2022107":{
			 title:"国庆",
			 type:"休",
		},
		"2022108":{
			 title:"国庆",
			 type:"班",
		},
		"2022109":{
			 title:"国庆",
			 type:"班",
		},
	 }
	 //判断 假期中有没有某个日期
	 export function isAuth(key) {
	 	// return vacation.indexOf(key) !== -1 || false
	 }
