const popupTexts = [
	'当心，我会咬你的！😈',
	'哇，你竟然点到我了！🙀',
	'不要点我，我怕痒！🤣',
	'救命！有只小怪兽！👾',
	'别点了，我可是有脾气的！😡',
	'你刚刚触发了我的秘密技能！🌟',
	'恭喜你，获得了幸运点击奖励！🎉',
	'我是你的数字精灵，有什么吩咐？🧚‍♀️',
	'嘘！这是个秘密通道入口！🔒',
	'你真棒，继续努力点击吧！👍',
	'嗨，点到我就是你的好运开始！🌈',
	'嘿，我是弹窗精灵，有什么需求吗？🪄',
	'快来帮我驱赶恶魔，点击就能消灭它们！👹',
	'小心，点击我可能会释放小小怪兽！👻',
	'想要一份点击能量吗？来点击我吧！⚡️',
	'我是隐藏任务触发器，看看你能找到几个吧！🔍',
	'喂！小心点，我可是有感情的！❤️',
	'别停，继续点击，惊喜在前方！🎁',
	'我是机会之窗，你今天运气爆棚！🍀',
	'点我点我，看看会发生什么神奇事情！🔮'
]

export const randomPopupTexts = () => {
	const randomIndex = Math.floor(Math.random() * popupTexts.length)
	return popupTexts[randomIndex]
}
